1. 将data转化为数据框对象，并添加列名为'name', 'year', 'sex', 'city'。

In [ ]:
import pandas as pd
data = {
    'name':['张三', '李四', '王五', '小明'],
    'sex':['female', 'female', 'male', 'male'],
    'year':[2001, 2001, 2003, 2002],
    'city':['北京', '上海', '广州', '北京']
}
## 填空
df1= pd.DataFrame(data, columns = ['name', 'sex','year', 'city'])
display(df1)

  name     sex  year city
0   张三  female  2001   北京
1   李四  female  2001   上海
2   王五    male  2003   广州
3   小明    male  2002   北京

2. 显示DataFrame的索引和列。

In [ ]:
display(df1) 
## 填空
print(df1.shape)
## 填空
print(df1.info())

:

3. 为数据框对象df2修改行索引和列名，分别为index = ['a','b','c','d']
columns = ['one','two','three','four']

In [ ]:
import numpy as np
df2 = pd.DataFrame(np.arange(9).reshape(3,3),
index = ['a','c','d'],columns = ['one','two','four'])
display(df2)
## 填空
df2=df2.reindex(['a','b','c','d'])
display(df2)

   one  two  four
a    0    1     2
c    3    4     5
d    6    7     8

   one  two  three  four
a  0.0  1.0    NaN   2.0
b  NaN  NaN    NaN   NaN
c  3.0  4.0    NaN   5.0
d  6.0  7.0    NaN   8.0

4. 为df2传入fill_value = n填充缺失值。

In [ ]:
##填空
df2=df2.reindex(columns=['one','two','three','four'])
display(df2)

5.将df1的'city'列，重建为索引。

In [ ]:
## 填空
df3=df1.set_index('city')
display(df3)

:

6. 利用df3的属性，显示其值，列名，元素个数，维度，形状。

In [ ]:
## 填空
print('信息表的所有值为：\n', df1.values)
print('信息表的所有列为：\n', df1.columns)
print('信息表的元素个数为：', df1.size)
print('信息表的维度是：', df1.ndim)
print('信息表的形状为：', df1.shape)

:

7. 分别选取列数据['name']和['name','year']。

In [ ]:
##填空
w1 = df1['name']
print('选取1列数据：\n',w1)
##填空
w2 = df1['name']
print('选取2列数据：\n',w2)

:

8.分别选取df3的前2行数据和2-3行数据。

In [ ]:
display(df3)
##填空
print('显示前2行:\n', df3.head(2))  
##填空
print('显示2-3两行:\n', df3. iloc[1:3])

     name     sex  year
city
北京     张三  female  2001
上海     李四  female  2001
广州     王五    male  2003
北京     小明    male  2002

显示前2行:
      name     sex  year
city
北京     张三  female  2001
上海     李四  female  2001
显示2-3两行:
      name     sex  year
city
上海     李四  female  2001
广州     王五    male  2003

9.利用loc和iloc选取行和列。

In [ ]:
##填空，显示name和year两列
display(df3.loc[ : , ['name', 'year']]) 
##填空，显示第1和第3行，行号从0开始
display(df3.iloc[[0,2]]) 
##填空，显示第1和第3行的第1列和第2列
display(df3.iloc[ [0,2], [0,1]])

     name  year
city
北京     张三  2001
上海     李四  2001
广州     王五  2003
北京     小明  2002

     name     sex  year
city
上海     李四  female  2001
北京     小明    male  2002

         sex  year
city
上海    female  2001
北京      male  2002

10.利用布尔选择，选择'year'为2001的行数据

In [ ]:
## 填空
df3['year'] = 2020
display(df3)

     name     sex  year
city
北京     张三  female  2001
上海     李四  female  2001

11.删除sex列数据，以及行索引为北京的行数据。

In [ ]:
##填空
df3.drop('sex', axis=1)
display(df3)
##填空
display(df3.head())

     name  year
city
北京     张三  2001
上海     李四  2001
广州     王五  2003
北京     小明  2002

     name  year
city
上海     李四  2001
广州     王五  2003

函数应用和映射:在数据分析时，经常会对数据进行较复杂的运算，此时需要定义函数。定义好的函数可以应用到pandas数据中，其中有三种方法：
（1）map函数，将函数套用到Series的每个元素中；
（2）apply函数，将函数套用到DataFrame的行与列上，行与列通过axis参数设置；
（3）applymap函数，将函数套用到DataFrame的每个元素上。

12.将水果价格表中的“元”去掉。

In [ ]:
data = {'fruit':['apple','grape','banana'],'price':['30元','43元','28元']}
df1 = pd.DataFrame(data)
print(df1)
def f(x):
    return x.split('元')[0]
## 填空
df1['price'] = df1['price'].apply(f)
print('修改后的数据表:\n',df1)

    fruit price
0   apple   30元
1   grape   43元
2  banana   28元
修改后的数据表:
     fruit price
0   apple    30
1   grape    43
2  banana    28

13.利用apply函数，求df2每列的平均值。

In [ ]:
df2 = pd.DataFrame(np.random.randn(3,3),columns = ['a','b','c'],
index = ['app','win','mac'])
print(df2)
##填空
df2.apply(lambda x: x.max() - x.min(), axis=1)

            a         b         c
app  1.215672 -0.749811  1.162634
win -0.410668  1.157174 -0.338714
mac  1.735388  0.737855 -1.264529

a    0.846797
b    0.381739
c   -0.146870
dtype: float64

14.利用applymap函数，为df2的每个元素保留3位小数

In [ ]:
print(df2)
##填空
df2.map(lambda x: x * 2)

            a         b         c
app  1.215672 -0.749811  1.162634
win -0.410668  1.157174 -0.338714
mac  1.735388  0.737855 -1.264529

          a       b       c
app   1.216  -0.750   1.163
win  -0.411   1.157  -0.339
mac   1.735   0.738  -1.265

15. 利用sort_values（）为df2的第1列从小到大排序。

In [ ]:
print(df2)
##填空
df2.sort_values(by='a')

            a         b         c
app  1.215672 -0.749811  1.162634
win -0.410668  1.157174 -0.338714
mac  1.735388  0.737855 -1.264529

            a         b         c
win -0.410668  1.157174 -0.338714
app  1.215672 -0.749811  1.162634
mac  1.735388  0.737855 -1.264529

16. 分别对df2按列汇总求和和按行汇总求和。

In [ ]:
display(df2)
## 填空
print('按列汇总:\n', df2.sum())
## 填空
print('按行汇总:\n', df2.sum(axis = 1))

            a         b         c
app  1.215672 -0.749811  1.162634
win -0.410668  1.157174 -0.338714
mac  1.735388  0.737855 -1.264529

按列汇总:
 a    2.540391
b    1.145218
c   -0.440610
dtype: float64
按行汇总:
 app    1.628495
win    0.407791
mac    1.208714
dtype: float64

17. 利用describe()对df2进行描述性统计

In [ ]:
## 填空
df2.describe

              a         b         c
count  3.000000  3.000000  3.000000
mean   0.846797  0.381739 -0.146870
std    1.119572  1.002129  1.224901
min   -0.410668 -0.749811 -1.264529
25%    0.402502 -0.005978 -0.801622
50%    1.215672  0.737855 -0.338714
75%    1.475530  0.947514  0.411960
max    1.735388  1.157174  1.162634